[{
"title": "Introduction",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html",
"text": "Introduction"
}
,{
"title": "What is Smart Nation?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#what-is-smart-nation",
"text": "What is Smart Nation? Smart Nation is a transformed Singapore where people will be more empowered to live meaningful and fulfilled lives, enabled seamlessly by technology, that offers exciting opportunities for all. It is where businesses can be more productive and seize new opportunities in the digital economy. It is a nation which collaborates with our international partners to deliver digital solutions and link and benefit people and businesses across boundaries. As PM Lee described it at the launch of Smart Nation in November 2014, it is a nation where “we can create possibilities for ourselves beyond what we imagined possible.” test"
}
,{
"title": "Why Smart Nation?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#why-smart-nation",
"text": "Why Smart Nation? We are at a most exciting and dynamic time in human history, and stand at the cusp of a new industrial revolution fuelled by digital technologies. Technological disruption is a global force we must confront and harness to our advantage. Today, developments in digital technologies are rapidly advancing, and the next frontier of technologies – big data analytics, artificial intelligence (AI), Internet of Things (IoT) and robotics – will fundamentally transform the global economy and change the way we live, work and relate to one another. Digitalisation will be pervasive, and change life as we know it. Many of today’s institutions, norms and habits, were designed around industrialisation. Similarly, our strategies and structures today will change with technology, and our adaptability to change will determine our success and ability to stay ahead. Smart Nation is integral to Singapore’s next phase of nation building. To continue to prosper and stay relevant in the world, Singapore needs to ride the waves of the digital revolution and capture the opportunities it brings, just as we embraced globalisation before. Digitalisation presents opportunities for Singapore to enhance Singapore’s traditional strengths, address and overcome our national challenges and physical limits, be it resource constraints or an ageing population, as well as build new sources of comparative advantage for Singapore. This new era of digital transformation will power Singapore to SG100 and beyond. To achieve Smart Nation, we start from a position of strength, riding on Singapore’s early investments in technology and connectivity infrastructure, and strong institutions that are ready to seize these opportunities. Our people are also digitally literate, with a strong pool of talent who perform well in the STEM (Science, Technology, Engineering and Mathematics) disciplines."
}
,{
"title": "A Brief History of Singapore’s National Digitalisation Efforts",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#a-brief-history-of-singapores-national-digitalisation-efforts",
"text": "A Brief History of Singapore’s National Digitalisation Efforts Singapore has done this before. In our history, we have undergone two successful whole-of-nation transformations in response to digital disruption. First, with National Computerisation from the 1980s to early-1990s, to transform Singapore into a regional centre for computer software development and services. Second, with the growth of the info-communications industry from the mid-1990s to early-2010s, to transform Singapore into a hyper-networked, global hub for services. It was in the early 1980s that the Government recognised computerisation as an essential tool for competing with the rest of the world, and mobilised the nation to embrace new technology. Since then, six national Info-communications Technology (ICT) masterplans have been launched. In the formative years, the focus was to computerise government agencies and drive up the quality and number of IT professionals in Singapore. Subsequent masterplans focused on extending computerisation and connectivity to the private sector. Source: Centre for Liveable Cities While each masterplan had a different emphasis to address challenges of the period, the underlying objectives have been clear and consistent – to guide the use of ICT to enhance Singapore’s international competitiveness, upgrade the skills of citizens especially the workforce, improve service standards, and attract knowledge-intensive activities."
}
,{
"title": "What Would a Smart Nation Look Like?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#what-would-a-smart-nation-look-like",
"text": "What Would a Smart Nation Look Like? Today, Singapore is at another pivotal moment in its digital transformation journey. The pace of technological invention and innovation is accelerating at an unprecedented rate, and we must do better to fully harness this power and potential to improve lives and create opportunities. Source: Smart Nation and Digital Government Office Our Smart Nation journey endeavours to transform Singapore through technology. Technology is only a means to an end, to enable significant improvements in how we live, work and play. We cannot simply apply the latest technologies on top of our existing processes and organisations. It will require a fundamental rethink of our long-held assumptions and how we operate. As a nation and city-state, Singapore’s Smart Nation initiative is unique among the efforts of many other smart cities. Singapore’s single layer of Government not only seeks to improve city and municipal services through technology, but has the capacity to drive transformation at the national scale. At a national level, we are able to drive economic and civic engagement, as well as enable efficient and effective planning and administration. At the same time, we can drive transformation in critical areas such as energy management, national security, trade and foreign relations. We are able and ready to make bold changes that will improve all aspects of our people’s lives. Our priority is to harness technology to address national challenges and drive transformation in key domains: health, education, transport, urban solutions, and finance. Health. Our healthcare system will move beyond healthcare to health, as Singaporeans will be better equipped and empowered to take care of their own health. Healthcare services, where they are needed, will be delivered efficiently. Singaporeans are already using wearable devices or smartphones to monitor their health and activities, and this data can empower individuals and inform service delivery.  Education. Digital technology unlocks a new realm of self-directed and collaborative learning. Relationships between students, teachers and parents, as well as capabilities of the physical infrastructure are augmented to create a holistic and conducive environment for effective learning. Routine and repetitive tasks are automated to help educators focus on the work that matters. In the long run, we will need to rethink our philosophies, content and modality of learning as technology evolves. Transport. Data analytics, smart systems and autonomous vehicles are key solutions for the future of transport planning and operations. Our roads and transport system will be optimised, making traffic smoother, public transport more comfortable and reliable, and the air cleaner with less need for private cars.  Urban Solutions. Our homes and estates will be safer, more comfortable and more sustainable. The use of sensors and smart systems will improve the effectiveness of municipal services, save energy and ensure sustainable use of resources.  Finance. Singapore will continue to be a leading regional and global financial hub, powered by financial institutions that readily adopt fintech solutions for better customer service, greater efficiencies in trade finance, strengthened supervision and reduced compliance cost.  At its core, Smart Nation is about empowering our people. Understandably, there might be some fears and tensions about technology destabilising livelihoods, raising costs and increasing vulnerabilities. However, if we identify these challenges and tackle them head on, technology can result in better jobs and business opportunities, more security and improvement of livelihoods. Everyone is part of Smart Nation, and will be better equipped to imagine, design and implement, as well as enjoy the opportunities and conveniences of a digital society. This means having the means to transact digitally, the skills and confidence to use technology, and the agility to adapt to change and keep up with the latest technologies to achieve a better quality of life, as well as contribute to innovations in the digital era. This will put us in good stead for an ever-changing global environment."
}
,{
"title": "Who Contributes to Smart Nation?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#who-contributes-to-smart-nation",
"text": "Who Contributes to Smart Nation? Smart Nation is for Singapore, and Singaporeans. It requires a whole-of-nation effort, involving every Government agency, every business, and also our people. The Government will take responsibility for the digital transformation of Government functions and services, and businesses must step up to transform and keep up with the winds of technological change. At the same time, Government will partner the civil society to drive the digital readiness and harness technology for stronger social cohesion."
}
,{
"title": "How Do We Become a Smart Nation?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/01-introduction.html#how-do-we-become-a-smart-nation",
"text": "How Do We Become a Smart Nation? Singapore has laid out mutually-reinforcing plans to build a Digital Economy, Digital Government and Digital Society, involving the public, private and people sectors. This means every industry, business and government agency stepping up to accelerate its digitalisation efforts, to build capabilities and solutions that will propel the nation forward. This whole-of-nation movement will be powered by a society of digitally ready citizens and communities, confident and eager to learn about and adopt digital technologies. Strong System Foundations must be in place. Cybersecurity will be the bedrock to secure all our digital efforts, protect users and inspire trust in a technological future for our nation. We need a robust and flexible data management systems and processes to ensure secure data sharing for policymaking, service delivery and operations. Singapore also needs to invest in digital infrastructure to enable the full-scale industrialisation of digital technologies and reap maximum efficiencies and benefits. We will level up our People and Culture to best capture this opportunity. Talent has always been Singapore’s advantage. As a nation, we are renewing our emphasis on building a technology culture. Individuals will need to foster a mind-set of lifelong learning to embrace change and strengthen our capabilities. Organisations will need to rethink their operating models to be more agile and bold. As a nation, we will need to strengthen our collaborations with the world. Every member of society must benefit from the opportunities and advancements that a Smart Nation will bring. This effort will be exemplified by a portfolio of major national projects, such as building digital infrastructure and improving service delivery. At the same time, we will continue to provide the environment and opportunities for collaboration and experimentation with frontier technologies. Our measure of success is how individuals and businesses are better served and better empowered to achieve their own success. Each project will involve the public, private and people sectors working closely to collectively transform Singapore."
}
,{
"title": "Digital Government, Digital Economy and Digital Society",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/02-digital-government-digital-economy.html",
"text": "Digital Government, Digital Economy and Digital Society To facilitate the transformation of Singapore, the government has outlined broad plans to transform our Economy, Government and Society through the Digital Economy Framework for Action, Digital Government Blueprint, and the Digital Readiness Blueprint. A Digital Government will provide the environment and drive enablers to shape the Digital Economy and a Digital Society. A Digital Economy will work closely with Digital Government to support the digitalisation of Government service delivery and build industry capability for future transformation needs. We are also doing further work to develop a holistic approach to cultivate a Digital Society which is confident to harness technology."
}
,{
"title": "Digital Economy",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/02-digital-government-digital-economy.html#digital-economy",
"text": "Digital Economy Going digital is a national imperative for a better future for Singaporeans. Digitalisation is about enabling new possibilities across the economy, with business growth and better jobs. Grasping these opportunities will allow Singapore to develop new comparative advantages and remain a smart and thriving nation that continually attracts investments and talents to her shores. The Singapore Digital (SG:D) movement was launched to spur our digitalization efforts, with the Government, companies, organisations and individuals to reap the benefits of a digital economy. Our vision is to be a leading digital economy that continually reinvents itself in the fourth industrial revolution. We do this via accelerating the digital transformation of existing economic sectors, fostering new ecosystems enabled by digital technologies, and developing a next-generation digital industry in sectors such as cybersecurity as an engine of growth. This is outlined in the Digital Economy Framework for Action by the Infocomm Media Development Authority (IMDA). The Digital Economy Framework for Action 1. Accelerate: To accelerate the digitalisation of our existing industries for productivity improvements, efficiency gains and new revenue opportunities Our economic agencies have a bold vision of digitalizing every industry and every business, raising productivity and efficiencies to grow the economy. In 2017, the Government rolled out 23 Industry Transformation Maps (ITMs) as part of the efforts under the Committee of Future Economy. Supporting these ITMs are Industry Digital Plans to facilitate digitalisation in selected industries. Our SMEs are an important foundation of the economy. The SMEs Go Digital programme helps to make going digital simple for SMEs. The Industry Digital Plans for SMEs (IDPs), which are aligned to the Industry Transformation Maps, provide SMEs with step-by-step guidance on the digital technologies to use at each stage of their growth – SMEs can self-assess their digital readiness, seek advice on their digitalisation journey, deploy curated solutions, participate in industry-led pilot projects and engage project management services to implement their digital projects. In addition, IMDA is working with businesses and government agencies on impactful projects that can accelerate the pace of digital change for industry sectors. These include innovative concepts in urban logistics such as federated lockers for more convenient last mile delivery, the Kampong Glam precinct-level transformation, and the Punggol Digital District which will be a vibrant and inclusive district underpinned by cutting edge technology and a hub for key growth sectors of the Digital Economy. 2. Compete: To enhance our economic competitiveness by fostering new integrated ecosystems converged around customers’ needs. Digitalisation is hastening the blurring of sector boundaries. Enabled by digital platforms, customers can increasingly dictate how products and services are designed and delivered around their needs, resulting in the formation of new business ecosystems and market intermediaries. These new ecosystems will form the foundation of future industries. Singapore aims to foster a conducive environment for the growth of such integrated ecosystems and support our businesses to innovate and evolve their business models, and become competitive in the global marketplace. To do so, we will support the innovation ecosystem, such as through the Open Innovation Platform (OIP). With the support of a structured innovation process, the OIP facilitates collaboration between problem owners and Infocomm Media (ICM) companies to accelerate the development of innovative, new and scalable solutions that address real business problems. 3. Transform: To develop the next generation digital industry as an engine of growth for the economy, and a driver of digitalisation across all industries. Last, but not least, we want to transform the ICM industry to be a key growth driver of Singapore’s digital economy. IMDA will continue in this area and create digital companies and capabilities of the future. As a nation, we are building deep capabilities in four frontier technology sectors – Data Science and Artificial Intelligence (AI), Cybersecurity, Immersive Media as well as Internet of Things (IOT) and Future Communications Infrastructure. Accreditation@SG:D aims to level the playing field for promising Singapore-based technology companies to win projects, grow and compete in the global market by helping them establish their credentials and facilitating access to Government and large enterprise buyers. It gives accredited companies the opportunity to be better-recognised overseas with a trusted Singapore branding. The Government will also facilitate overseas growth of Singapore companies through targeted programmes for Singapore enterprises, in collaboration with agencies such as Enterprise Singapore. The Singapore Economic Development Board, Enterprise Singapore, and Infocomm Media Development Authority will jointly take the lead in engaging leading digital companies globally and grooming Singapore-based digital companies, to create good jobs, accelerate the building of capabilities and encourage technology collaborations in our local ecosystem. In addition, four cross-cutting enablers will support these pillars of growth: • Talent: To continually up-skill, re-skill and raise the digital capabilities of the workforce. • Research and Innovation: For firms to innovate and leverage intellectual property for competitive advantage, harnessing the capabilities in our research and innovation community. • Policy, Regulations and Standards: To ensure that our policy and regulatory environment, including the environment for data innovation, is globally competitive in a digital world. • Physical and Digital Infrastructure: To ensure that connectivity, platforms, data and other infrastructure support the growth of the digital economy."
}
,{
"title": "Digital Government",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/02-digital-government-digital-economy.html#digital-government",
"text": "Digital Government The Singapore Government endeavours to build leaner and stronger public agencies which are digital to the core, at the global leading edge of service delivery, transformation and innovation. The government will empower public servants to continue to serve with heart, commanding strong public trust, confidence and support. Outlining the strategies and desired outcomes for this transformation is the Digital Government Blueprint by the Smart Nation and Digital Government Group. Digital Government Blueprint The Singapore government is bold and committed in its ambition to transform itself. The Digital Government Blueprint is only the first statement of intent to enable a public service that is leaner and stronger, with skilled and adaptable officers at the leading edge of service delivery and innovation. It spells out how we will organise ourselves around our mission and stakeholders, rather than be bound by organisational boundaries and processes. At the same time, we are undergoing a fundamental overhaul of our technology infrastructure to operate more nimbly and effectively, not unlike the digital giants of the world. We are moving towards a government that is able to leverage data, cloud computing and a micro-services architecture by building a Singapore Government Tech Stack. We are also making strategic bets in frontier technologies like artificial intelligence (AI) to ensure that our digital and physical systems are intelligent to the core. This re-engineering of our technical infrastructure will allow the Government to more efficiently and effectively collaborate with the people and private sectors to deliver policies and services. At the same time, the Government is also rethinking its manpower and workforce strategies to grow our technology talent pool, incentivise for excellence and upskill public officers with data science and AI capabilities. The Digital Government Blueprint sets out bold targets to be achieved by 2023: Together, the public and private sectors will drive sectoral masterplans in key domains and industry sectors. These will outline how technology will be used to improve lives and create new business opportunities. These include the Industry Transformation Maps as well as domain roadmaps in health, education, transport and urban solutions and finance."
}
,{
"title": "Digital Society",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/02-digital-government-digital-economy.html#digital-society",
"text": "Digital Society In a Smart Nation, Singaporeans are empowered to maximise the opportunities and leverage conveniences of a digital society to lead meaningful lives. The Government will support this by making our services more accessible, raising our people’s digital literacy, and encouraging people to participate in digital communities and platforms. To support this, the Ministry of Communications and Information has introduced a Digital Readiness Blueprint. Digital Readiness Blueprint Digital technologies can make our daily lives more convenient and sustainable, and they can also empower us to strengthen our community bonds by enabling us to connect to and look out for one another. The Digital Readiness Blueprint, written with input from the people and private sectors, sets out recommendations for building Digital Readiness in Singapore, guided by four strategic thrusts: Expand and Enhance Digital Access for Inclusivity Infuse Digital Literacy into the National Consciousness Empower Community and Businesses to Drive Widespread Adoption of Technology Promote Digital Inclusion by Design Guided by this framework, the blueprint offers 10 recommendations: Make access to basic digital enablers as widespread as possible Customise access package for those with specific needs Identify a set of basic digital skills for everyday activities to spur take up of digital technology, especially among the less digitally savvy Strengthen focus on information and media literacy to build resilience in an era of online falsehoods. Ensure that our children and youth grow up to form meaningful relationships with people around them and use technology to benefit their communities Encourage private and people sector organisations to amplify efforts and help more Singaporeans adopt technology Provide one-on-one assistance to make it easy for Singaporeans to adopt technology, especially those who find it challenging Provide support for projects that create opportunities for community participation Encourage organisations to design for inclusion Reach out to more Singaporeans by ensuring that relevant digital services are made available in vernacular languages As more public and private sector services go digital, we will all be nudged into increasingly digital behaviours. While we acknowledge that there are fears and anxieties surrounding the use technology, the speed at which we become a Digital Society is dependent on how quickly we are able to adapt. We must recognize how our daily digital behaviour contributes to better policy insights and service delivery, and actively work towards being digital individuals. As more public and private sector services go digital, we will all be nudged into increasingly digital behaviours. While we acknowledge that there are fears and anxieties surrounding the use technology, the speed at which we become a Digital Society is dependent on how quickly we are able to adapt. We must recognize how our daily digital behaviour contributes to better policy insights and service delivery, and actively work towards being digital individuals."
}
,{
"title": "System Foundations",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html",
"text": "System Foundations Strong and secure foundations in cybersecurity, as well as data and digital infrastructure, are essential to driving whole-of-nation transformation across economy, government and society."
}
,{
"title": "Ensuring reliable and secure cyber foundations",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html#ensuring-reliable-and-secure-cyber-foundations",
"text": "Ensuring reliable and secure cyber foundations As more services and transactions take place online amidst persistent cyber threats, it becomes even more important that they are digitally secure and reliable. Singapore has always prioritised cybersecurity in our Smart Nation journey. The Cybersecurity Agency of Singapore was formed in 2015 to provide centralised oversight of national cybersecurity functions. The Singapore Cybersecurity Strategy was published in 2016, outlining priorities to build a resilient infrastructure, create a safer cyber space, develop a vibrant cybersecurity ecosystem and strengthen international partnerships. We have also developed cybersecurity plans in 11 Critical Information Infrastructure (CII) sectors. Some initiatives under the Strategy that provide this secure foundation include enacting the Cybersecurity Act and conducting the CII Protection Programme to raise cyber readiness in our critical sectors. This helps protect CII, which when compromised would have a debilitating impact on the delivery of essential services and the Singapore economy. With inter-dependencies of global trade and financial markets today, these attacks could also have serious spill-over effects on other countries. As such, CSA also champions regional cyber capacity building initiatives, such as the ASEAN CERT Incident Drill (ACID), and the ASEAN Cyber Capacity Programme (ACCP). For Smart Nation projects, SNDGG and the Cybersecurity Agency of Singapore (CSA) also work closely through the Smart Nation Cybersecurity Committee (SNCC) to ensure security-by-design, where cybersecurity is incorporated from the onset. This includes providing guidance on security principles, design and implementation, and approving design trade-offs based on the relevant threat-risk assessments. CSA is also spearheading efforts with other international government agencies, research institutes and industry, to drive a global effort to secure the Internet of Things (IoT) through an International IoT Security Initiative."
}
,{
"title": "Key initiatives to ensure resilient, secure cyber foundations:",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html#key-initiatives-to-ensure-resilient-secure-cyber-foundations",
"text": "Key initiatives to ensure resilient, secure cyber foundations: National Cybersecurity Strategy 2016 Strengthen the resilience of our Critical Information Infrastructure (CII) Mobilise businesses and the community to make cyberspace safer by countering cyber threats, combating cybercrime and protecting personal data Develop a vibrant cybersecurity ecosystem comprising a skilled workforce, technology-advanced companies and strong research collaborations Step up efforts to forge strong international partnerships Cybersecurity Act 2018 Legal framework for the oversight and maintenance of cybersecurity in Singapore Four objectives: Strengthen the protection of CII against cyber-attacks Authorize CSA to prevent and respond to cybersecurity threats and incidents Establish a framework for sharing cybersecurity information Establish a light-touch licensing framework for cybersecurity service providers"
}
,{
"title": "Maximising the value of data in a trusted environment",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html#maximising-the-value-of-data-in-a-trusted-environment",
"text": "Maximising the value of data in a trusted environment Data is a key resource in Smart Nation. It will enable our businesses to grow and create new business opportunities, and allow Government to have more informed policymaking, service delivery and operations. Singapore will be a global hub for data, akin to our world-class airport and seaport. Data will form a key foundation upon which we derive insights and build intelligent systems. Our public and private sector organisations will need to develop the systems, processes, and capabilities to maximise the value of data. In many organisations, there is often a lack of awareness on how data can be used, how to improve the quantity and quality of datasets, and how to fuse data from different sources for new insights. The Government is leading the way to facilitate effective data sharing between public agencies, to support data-driven policymaking, operations and service delivery. To do this, government data will be organised around an Integrated Data Management Framework under centralised oversight of the Government Data Office. This establishes new ways of managing and using data across the four-stage lifecycle of acquisition, fusion, access and distribution and exploitation, across four key domains of individual, company, geospatial and sensors."
}
,{
"title": "Shifts in the Government Data Strategy",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html#shifts-in-the-government-data-strategy",
"text": "Shifts in the Government Data Strategy Government data will be organised around a new Integrated Data Management Framework, including reviewing legislation, implementing policy, and building capabilities and shared services. This will achieve system outcomes, such as: Reducing the time and resources expended by individual source agencies to clean and verify acquired data for different data requestors. Restricting the fusion of datasets to specific centres for data protection, and efficiency in distributing fit-for-purpose data sets to users. Allowing the expeditious access to data and analytics capabilities for policy analysis, operations, service delivery and private sector facilitation. Where there is public interest and benefit to Singapore and Singaporeans, the Government will also share Government-verified data with the private sector, such as via the MyInfo platform as part of the National Digital Identity project. We are also scaling up our open data initiative with better organization and more datasets on data.gov.sg for citizens and communities to co-create and leverage on. For the private sector, we have set up a Data Innovation Programme Office to advise companies how to better harness data, and to encourage data-driven innovation projects. Working with industry leads, it will scale up data collaboration efforts, which allows companies to share data securely and access data analytics tools. Together with the Personal Data Protection Commission, regulatory support and clarity is provided through practical guidance and regulatory sandbox. This will help facilitate data sharing arrangements that have benefits to the public. At the same time, we recognise that our continued ability to harness data to drive better service delivery and economic dynamism is premised on continued trust by our businesses and people, that data will be shared and used in a way that respects confidentiality and privacy. A trusted digital environment is key to confidence and participation in a Smart Nation. Hence, our laws and policies must therefore ensure proper safeguards to protect personal data, while promoting sharing and innovation. In order to support businesses in building consumer trust, IMDA has also developed the Data Protection Trustmark certification to help businesses verify their conformance to personal data protection standards and best practices. DPTM certification provides validation of an organisation’s data protection regime, thereby strengthening its reputation and raising its business competitiveness. The Personal Data Protection Act (PDPA), enacted in 2012, outlines a baseline standard of protection for personal data across the economy. The Government is currently reviewing the PDPA to ensure that our regulatory environment keeps pace with the evolving needs of organisations and individuals in a digital economy, and enables the legitimate use of personal data while safeguarding consumers’ trust. To provide greater safeguards and clarity regarding the use of data by and within the public sector, a new Public Sector (Governance) Act was enacted in 2018 to ensure that data can be shared in a safe, responsible and appropriate manner. Going forward, the Government will also work towards the establishment of new governance frameworks and guidelines on the use of artificial intelligence. We will continue to work on data protection accreditation frameworks, advisory guidelines and tools to help organisations, as well as participate in international and regional mechanisms to promote cross-border data flows. Key initiatives to maximize the value of data in a trusted environment: MyInfo Data Collaboratives Personal Data Protection Act Data Regulatory Sandbox Data Protection Trustmark Public Sector (Governance) Act"
}
,{
"title": "Developing next-generation digital infrastructure to catalyse widespread digitalisation",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/03-system-foundations.html#developing-next-generation-digital-infrastructure-to-catalyse-widespread-digitalisation",
"text": "Developing next-generation digital infrastructure to catalyse widespread digitalisation Singapore will develop next-generation digital infrastructure that forms the foundation of our Smart Nation, building on earlier investments in connectivity and Internet penetration. Innovative products and services can be built on top of this infrastructure. We will further enhance connectivity infrastructure, particularly for mobile and IoT devices. The telcos will roll out 5G mobile networks approximately by 2020, and have already announced plans for national NB-IoT networks. We are expanding the coverage of fibre broadband and Wireless@SG, to ensure that every person and business has access to high speed Internet. To improve our connectivity with the rest of the world, we will continue to strengthen Singapore’s position as a global digital hub. We will accelerate the development of national digital platforms that serve the needs of the both Digital Economy and Digital Government, starting with the Strategic National Projects (SNPs) – National Digital Identity (NDI), E-payments and the Smart Nation Sensor Platform (SNSP). These are enabling platforms and infrastructure that will benefit multiple stakeholders – the private sector, citizens and also multiple Government agencies – and enable the further development of digital services. The Government plays a key role in developing these platforms, including setting standards, ensuring interoperable platforms, leading adoption initiatives and engaging the public on the use of such platforms, and will partner the private sector to do so. (More on NDI, E-payments and SNSP can be found in the Projects section.) Singapore has also adopted the Pan European Public Procurement On-Line (PEPPOL) standard for nation-wide e-invoicing, which is being driven by both the public and private sector. One of the strategies to achieve Digital Government is to build common digital and data platforms. Private sector companies such as Amazon, Google and Dropbox utilise an organisation-wide technology stack, which is a bundle of software components used in building digital applications. The Singapore Government Tech Stack will outline the on-premise hosting platforms, middleware, micro-services and standards/tools needed to form a full suite of services for agencies’ use. This will empower agencies to better design applications and services around the needs of citizens and businesses to support our digitalisation efforts, while paving the way for closer collaboration between the private and public sector to share data and build services for citizens and businesses. Singapore Government Tech Stack Layers On-premise hosting platforms used to host classified systems and data on Government-owned servers; Middleware, which are software modules for common functions used in application development (such as centralised gateways to enable easy data sharing, automated functional testing of web and mobile applications); Library of micro-services which will consolidate commonly-used micro-services so that agencies can consume and share them easily, ensuring commonality and inter-operability between agencies’ applications; and Overarching Elements Standards and tools are overarching elements specific to the SGTS that will ensure alignment across all Government digital services, such as design standards for websites, guidelines for API design and workflow management tools. Digital infrastructure will also allow Singapore to build upon our existing strengths in connectivity and trade. Sectoral platforms such as the National Trade Platform facilitate obtaining regulatory approval from Singapore authorities, sharing information between companies, and for firms to offer supporting services like trade financing, insurance and forwarding. Such projects will allow businesses to transact with one another in a seamless and paperless manner, throughout the value chain, including for cross-border transactions. Key initiatives in building strong digital infrastructure Next-generation connectivity (e.g. 5G, NB-IoT, Wireless@SG) Singapore Government Tech Stack National Digital Infrastructure National Digital Identity E-Payments (e.g. FAST, PayNow, SGQR) Smart Nation Sensor Platform E-Invoicing (PEPPOL standard) National Trade Platform"
}
,{
"title": "People and Culture",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/04-people-and-culture.html",
"text": "People and Culture To effectively harness the power of digital infrastructure, data and to ensure cybersecurity, we will need to support our people to be Smart Nation-ready by inculcating new mind-sets and promoting upskilling."
}
,{
"title": "Promoting an innovation and technology culture",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/04-people-and-culture.html#promoting-an-innovation-and-technology-culture",
"text": "Promoting an innovation and technology culture As individuals, we need to consider two key shifts. First, a shift from linear pathways of education employment, to needing an attitude of lifelong learning and upskilling. In the past, once a person had a good education, he would most likely be prepared for his career and the rest of his life. Today, that concept has been disrupted by the necessity for lifelong learning, especially with technology. Every job of the future will evolve with technological change and require a higher level of digital literacy. Second, individuals need to shift in from being a consumer to an active co-creator and contributor. The Government cannot, and should not be the solution to all problems. In many ways, individuals are already actively using digital tools to shape their communities. For example, many informal WhatsApp and Facebook groups bring individuals together to rally around specific causes. Civic and community groups can harness open data and APIs on data.gov.sg to co-create new solutions and work with Government to serve needs and advance causes. Our companies and institutions, no matter how large or small, can no longer operate business-as-usual. We will need to aspire to be “intelligent to the core” and strengthen integration between business operations, people and technology. Organisations need to think deeply about how to be mission and customer-centric, and prioritise investing in capabilities to manage their data and digital systems effectively and securely. Technologies like cloud computing and AI will fundamentally shift business operations, and organisations will need to rethink how it builds capabilities for its people and systems in tandem. As a nation, we need to have a “dare to try” mind-set and be open to experiment with new ideas and take manageable risks. At the same time, we must be willing to embrace failure – fail fast and learn quickly, and have the resilience to bounce back and try again. The Government will lead by example by allowing more flexibility in resource allocation for technology projects and public sector innovation. To support industry, the Government will also adopt a balanced regulatory approach to support innovation, and step in only when needed in the public interest, such as for consumer safety, public interest or in ensuring the stability of national systems. Regulatory sandboxes and test-beds have already been set up to support innovation in areas such as drones, autonomous vehicles and fintech, to facilitate innovation while providing the Government the time to better understand the potential of the technologies alongside the innovation process. We should also focus on strengthening Singapore’s relationship with the world. Technology increasingly transcends borders and the acceleration of technological change enhances the benefits and dangers of globalisation. Singapore has the unique opportunity of being a Global-Asia node for technology and innovation. Singaporeans are encouraged to learn from the best abroad and apply their knowledge back home. At the same time, we will need to collaborate closely with our regional and global partners, as well as Singaporeans abroad, to build common digital infrastructure and norms. Today, our schools nurture our students to thrive in a rapidly-changing world by developing confident, independent learners who have the skills and heart to contribute back to their communities. These skills are captured in the 21st Century Competencies framework. We will also consider how to prepare our population to think computationally in the digital age, and continually review school curriculum and programmes to ensure relevance to the future workplace and society."
}
,{
"title": "Building a digitally-ready workforce to seize new opportunities",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/04-people-and-culture.html#building-a-digitally-ready-workforce-to-seize-new-opportunities",
"text": "Building a digitally-ready workforce to seize new opportunities Singapore needs to have a ready pool of skilled ICT manpower, who can help companies and the Government seize opportunities in digitalisation as and when they arise. At the same time, as the use of digital technologies becomes more pervasive, today’s working population would need to reskill to be ready for jobs in a digital age. Central to this effort is the national SkillsFuture movement. As part of SkillsFuture, tripartite partners have established the TechSkills Accelerator (TeSA), which offers various programmes to cultivate digital leaders, upskill our ICT workforce and to support non-ICT professionals who wish to transit to the ICT sector. Another programme is the SkillsFuture for Digital Workplace, aimed at equipping all Singaporeans with the mind-set and basic functional skills for the future economy. Businesses will need to prioritise upskilling their employees, and individuals are encouraged to cultivate a habit of lifelong learning. The Government will similarly put in place programmes to raise the digital literacy of public officers, with a goal of training 20,000 public officers in data analytics and data science by 2023. To strengthen in-house digital capabilities in the public sector, we have established a Centre of Excellence for ICT and Smart Systems (ICT&amp;SS) in GovTech. The Centre of Excellence houses capability centres in Data Science and AI, Sensors and IoT, ICT Infrastructure, Applications Development, Cybersecurity and Geospatial Technology, and will support the rest of Government in building technical capabilities. To groom more technology leaders, we are also reviewing our public sector leadership schemes to establish clearer career pathways for ICT&amp;SS talent to meet their aptitudes and aspirations, and are also introducing a Government-wide ICT&amp;SS scheme of service, as a means to enhance the Government ICT&amp;SS career proposition. The recently launched Smart Nation Scholarship signals our commitment to growing technology expertise in the public sector. To optimise the deployment of our technical talent, and achieve greater interoperability and economies of scale of digital systems, we are also strengthening functional leadership for the ICT&amp;SS profession to better coordinate the efforts of the community across the whole-of-Government. Our economic agencies will continue to support multinational corporations and local enterprises to ensure that Singapore remains an attractive place for top international talent and firms to relocate here, and for overseas Singaporeans to return home. Especially for fields where talent is scarce, we will review talent attraction schemes and create meaningful work for to attract top talent, which will in turn support native capability building. To leverage expertise outside of Government, the Smart Nation Fellowship brings top data scientists and technologists to Singapore to collaborate with the Government on specific projects for short to medium-term stints. If we can do all these right, we can get the right mix of local and foreign talent to make Singapore a creative, fertile innovative and enterprising environment. Key initiatives in this section: SkillsFuture Singapore TechSkills Accelerator (TeSA) Smart Nation Scholarship Smart Nation Fellowship Centre of Excellence for ICT and Smart Systems"
}
,{
"title": "Ensuring everyone benefits from Smart Nation",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/04-people-and-culture.html#ensuring-everyone-benefits-from-smart-nation",
"text": "Ensuring everyone benefits from Smart Nation In a Smart Nation, everyone will benefit. Technology will be so seamlessly integrated in our infrastructure and institutions, everyone, regardless of technological ability would enjoy significant improvements in day-to-day living. For example, sensors can help detect when an elderly person has fallen down and alert the relevant personnel, without him or her having to actually operate technology. Technology also has the power to be a social leveller. Hence, we need to dedicate resources to ensure that all Singaporeans, including the vulnerable, such as the elderly, low-income and persons with disabilities, are able to seize the opportunities offered by digital technologies. The Government will work closely together with the people and private sectors to deliver on the Digital Readiness Blueprint, which outlines initiatives to help all Singaporeans, regardless of age or ability, to have digital access and literacy to participate in Smart Nation. For example, we will look into how we can enhance our support for vulnerable segments to have basic digital enablers, including internet connectivity and smart devices. Already, initiatives like the Home Access Programme and Enable IT programme are proactively supporting segments in need. The Government will also work with tripartite partners to raise digital service standards and establish digital concierge-like services and digital clinics in the community, to assist those who are less comfortable with technology wth using digital services. Businesses and individuals can volunteer with IMDA’s Silver Infocomm Initiative to help bridge the digital divide among seniors (aged 50 years and above), and empower seniors to live a digital lifestyle for greater convenience and to connect to the community. IMDA has also rolled out a Basic Digital Skills curriculum which articulates a set of basic digital skills everyone needs to enjoy greater convenience and participate meaningfully in a Digital Society. The Government will also uphold the principle of digital inclusion by design, ensuring that all products and services align with international accessibility standards, and encouraging businesses to do likewise. The Government will constantly review its Digital Service Standards to ensure that its digital standards and design principles are inclusive. Beyond this, the Government will support digital projects and that create opportunities for community participation, as well as ground-up efforts that encourage more Singaporeans to adopt technology."
}
,{
"title": "Smart Nation Projects",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/05-smart-nation-projects.html",
"text": "Smart Nation Projects When we have talented, hardworking enterprising people able to work effectively with data and digital platforms in multi-disciplinary teams, Singapore will see Smart Nation delivered through a portfolio of digital projects. These will manifest in digital interactions that will not only enhance daily living, but also build comparative advantages for Singapore. Strategic National Projects will demonstrate the pervasive impact of digital technologies, and involve close collaboration across public, private and people sectors. In addition, the Digital Government Blueprint has set out targets for Government agencies to deliver projects in the fields of data analytics and AI, with an emphasis on cross-agency collaboration and transformative impact."
}
,{
"title": "Strategic National Projects",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/05-smart-nation-projects.html#strategic-national-projects",
"text": "Strategic National Projects As part of the Smart Nation initiative, the Strategic National Projects (SNPs) are examples of digital transformation at the national scale. They all demonstrate a re-engineering and re-thinking of how we want to live, work and play in a Smart Nation. These Projects include: The development of a National Digital Identity ecosystem to provide users with a single digital identity to transact with the Government and private sector organisations securely and conveniently. A greater push for E-Payments to enable citizens, businesses and Government agencies to make simple, safe and seamless digital payments, reducing the need to handle cash and cheques. Bundling together services and information from a citizen-centric lens and providing citizens with a digital way to transact high-touch services through the Moments of Life initiative. The Smart Urban Mobility project leverages data and digital technologies, including artificial intelligence and autonomous vehicles, to further enhance the public transport commute. By building the Smart Nation Sensor Platform, Singapore will have an integrated nation-wide sensor platform to improve municipal services, city-level operations, planning and security. It will enable us to build and run a smarter, greener and liveable city. CODEX (Core Operations, Development Environment, and eXchange) will be our digital platform that will better allow the public and the private sectors to work together to develop more user-centric services for the public, faster and more cost efficiently. We will continue to explore Strategic National Projects in key priority domains, such as healthcare to support key national priorities (e.g. raising business productivity)."
}
,{
"title": "Securing Our Future",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/05-smart-nation-projects.html#securing-our-future",
"text": "Securing Our Future Globally, we are at the cusp of a revolution, and in Singapore, at a pivotal moment in nation-building. Although digital technologies will accelerate the clock speed of change, the impact and consequences of how technology will impact life as we know it will take time to unfold. Smart Nation was launched in November 2014, and we are only in the early days of the digital revolution and our Smart Nation initiative. The effects of this digital era may not always seem revolutionary in the short term, but we can expect fundamental changes to society and economy in the decades to come, changes as profound as those resulting from electricity and the combustion engine of previous industrial revolutions. Beyond delivering on the future we can foresee, Singapore must continue to push ahead in this fast-moving space, to continually innovate and transform ourselves, and strengthen our capabilities and expertise so that we are prepared for the unknown. We have to boost our technological capabilities to overcome physical and manpower constraints. To achieve this, Singapore needs to continue to strengthen the nexus between academia, industry and Government, make strategic bets in frontier technologies and form strong relationships with the international community to secure our future."
}
,{
"title": "Strengthening the academia-industry-Government nexus",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/06-strengthening-nexus.html",
"text": "Strengthening the academia-industry-Government nexus Singapore has always believed in research, innovation and enterprise as cornerstones of our national strategy. We will need to continue to strengthen the nexus between academia and research centres and industry, to unlock economic potential. The Government These in turn are aligned with national priorities to tackle Singapore’s national challenges, such as improving healthcare and transforming our urban landscape for greater liveability and sustainability. Public investment in research and innovation has continued to grow over the last 25 years. Most recently, the Government set aside S$400 million to support Research, Innovation and Enterprise (RIE) in the Services and Digital Economy strategic technology domain from 2016 to 2020 under the RIE 2020 Masterplan. The domain includes programmes to drive digital innovation in urban mobility, healthcare ICT, and services productivity. It will also support the building of capabilities in AI, IoT and cybersecurity. Singapore’s universities have also steadily risen up in global rankings and improved their research influence internationally. Singapore has attracted top research scientists and has strong partnerships with global research centres. We need to continue to ensure that these investments in R&amp;D catalyse new economic activity. To develop a vibrant startup ecosystem to leverage these opportunities, the Government has established the Startup SG programme which provides comprehensive support in areas such as funding, mentorship, talent attraction and internationalisation, among others. The public and private sector will work closer than ever to foster a strong ecosystem that attracts the top talent and capital, which allows the most innovative ideas to thrive."
}
,{
"title": "Make strategic bets in artificial intelligence and other frontier technologies",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/07-make-strategic-bets.html",
"text": "Make strategic bets in artificial intelligence and other frontier technologies Singapore will also need to continue to be at the forefront of the latest technologies, and chart new frontiers for Smart Nation. One such area is in intelligent systems powered by artificial intelligence (AI). Intelligent Systems provide us an opportunity to overcome our population and workforce constraints by generating quantum leaps in productivity and efficiency, through automation and augmenting human physical and cognitive abilities. AI will also pervasively transform every aspect of how we live, work and play by enabling personalisation and anticipatory services. Singapore has started to make significant investments to drive development and adoption of AI. Singapore is investing up to $150 million over five years in research through AI Singapore, to use AI to solve major challenges that affect society and industry. This is done through the Grand Challenges, investing in deep capabilities to catch the next wave of scientific innovation and broadening adoption and use of AI within industry through the 100 Experiments initiative. The AI Business Partnership Programme also encourages and facilitates AI adoption among businesses in Singapore through pairing end user companies with AI solution providers. The Government is also making plans to develop digital infrastructure and ensure that its agencies are AI-ready, as well as ensuring that the talent attraction and manpower policies are in place to develop deep capabilities in Singapore. The Government is also proactively seeking use cases for the deployment of AI, and has committed to at least one AI project per Ministry Family by 2023. At the same time, we are also conscious that AI will disrupt society, as well as precipitate new challenges in ethics and governance. Hence, we will take a balanced and pragmatic approach to build a trusted ecosystem to drive AI development and adoption. IMDA has published a discussion paper on what a possible AI governance framework might look like, set up initiatives such as the Advisory Council on the Ethical Use of AI and Data to promote responsible development and deployment of AI by businesses, and the Research Programme on the Governance of AI and Data to develop local capabilities to understand and mitigate AI risks. IMDA has also started a Regulators Roundtable - a community of practice among sector regulators to co-ordinate and align AI regulatory approach. Regulators for private sectors will adapt the reference AI governance framework in the development of their sector-specific frameworks. Government sector will also incorporate the discussion paper in developing an AI governance framework for the public sector. Government Efforts on AI Ethics and Governance Discussion Paper on Artificial Intelligence (AI) and Personal Data – Fostering Responsible Development and Adoption of AI recommends two key principles: a. Decisions made by or with the assistance of AI should be explainable, transparent and fair to consumers. b. AI systems, robots and decisions should be human-centric. The discussion paper’s four-stage reference governance framework illustrates how these principles can be put into practice by different stakeholders. The Advisory Council on the Ethical Use of AI and Data, announced on 5 June 2018, is an industry-led initiative to examine legal and ethical issues raised by commercial deployment of AI, to encourage industry to develop and adopt AI technologies in an accountable and responsible manner. This will help to foster consumer understanding and trust, which is necessary for the important innovations that will grow our economy and improve lives. In the course of its work, the Advisory Council will assist the Government to develop voluntary codes of practice to guide corporate decision makers, serve as a barometer of consumers’ acceptance of innovative data use, and make recommendations on ethical and legal issues that may require policy or regulatory changes. The Research Programme on the Governance of AI and Data has been set up following the award of a five-year research grant from the National Research Foundation to the Singapore Management University in June 2018. The goals of the Research Programme are to develop international thought leadership and advance scholarship and discourse in legal, regulatory, ethical and policy issues arising from the use of AI and data. This is done through research publications and stakeholder engagement events and activities. Singaporeans will also get to pick up artificial intelligence basics with an AI for Everyone (AI4E) programme to help familiarise them with AI and help them understand how it can be used in their daily lives. There are many frontier technologies that are still evolving every day. We have only begun to make forays as a nation in the emerging technologies of Internet of Things, cyber-physical systems, blockchain, Augmented and Virtual Reality, as well as quantum computing. The technologies once found in science fiction are starting to materialise, and experiences that we could only once dream of are becoming reality. Our challenge is to be alive to the possibilities and take practical steps to channel these technologies to ensure the continued prosperity of Singapore."
}
,{
"title": "Strengthen Singapore’s collaboration with the international community",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html",
"text": "Strengthen Singapore’s collaboration with the international community"
}
,{
"title": "Strengthening Singapore’s connectivity with the world",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html#strengthening-singapores-connectivity-with-the-world",
"text": "Strengthening Singapore’s connectivity with the world Singapore has thrived as a transport and logistics hub with a world-class airport and port, physically connected to the world. To respond nimbly to a rapidly changing world, Singapore needs to drive seamless online-offline connectivity, to make Singapore a desired hub for critical trade and information flows. Singapore will continue to invest in digital infrastructure and programmes with our regional and international partners, layering on digital services to deepen our physical connectivity. In addition to physical connectivity, Singapore also participates in the APEC Cross-Border Privacy Rules (CBPR) and Privacy Recognition for Processors (PRP) Systems. The APEC CBPR/PRP Systems provide the participants an avenue for cross-border data transfers as they all adhere to an APEC-approved standard set of certification requirements. This reduces the challenge of organisations having to comply with multiple systems of domestic laws when they operate in multiple APEC Economies. Companies that achieve APEC CBPR or PRP certifications will be differentiated as trusted data processors that adhere to regionally approved and recognised data protection standards."
}
,{
"title": "Sharing best practices and exchange of ideas",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html#sharing-best-practices-and-exchange-of-ideas",
"text": "Sharing best practices and exchange of ideas Singapore will also continue to be an active player in regional and international technology conferences, contributing to discussions, thought leadership and scholarship around technology regulation and norms. We actively welcome international counterparts to visit and co-organise activities and exchanges."
}
,{
"title": "Building long-term relationships to address shared challenges",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html#building-long-term-relationships-to-address-shared-challenges",
"text": "Building long-term relationships to address shared challenges As technology develops, new challenges common to all cities and countries will emerge. Singapore will continue to strengthen our relationship with regional and international partners to work closely on global challenges, such as achieving the Sustainable Development Goals and cyber defence."
}
,{
"title": "ASEAN Smart Cities Network",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html#asean-smart-cities-network",
"text": "ASEAN Smart Cities Network The ASEAN Smart Cities Network (ASCN) is a collaborative platform where ASEAN Member States work towards the common goal of smart and sustainable urban development with technology as an enabler. 26 cities from the 10 ASEAN countries have been named pilot cities for this network, including Singapore, Johor Bahru, Phuket, Yangon, Phnom Penh and Vientiane. At the inaugural meeting in July 2018, the ASEAN Member States formally endorsed the ASEAN Smart Cities Framework. Member cities also shared their action plans and smart city projects and kick-started collaboration with private-sector solution providers for commercially viable projects. Singapore is also leading the efforts to develop an ASEAN Framework on Digital Data Governance to facilitate harmonisation of data regulations. This Framework will help organisations enjoy more clarity, potentially save on compliance costs by minimising the challenges of addressing multiple data protection standards across different jurisdictions, and boost consumer confidence in the participating organisation’s standard of handling consumers’ data responsibly."
}
,{
"title": "Regional and International Cooperation on Cybersecurity",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/08-strengthen-collaboration.html#regional-and-international-cooperation-on-cybersecurity",
"text": "Regional and International Cooperation on Cybersecurity ASEAN leaders also reaffirmed the need to build closer cooperation and coordination with each other on cybersecurity policy development and capacity building initiatives, recognising that cybersecurity is a cross-cutting issue that requires coordinated expertise from multiple stakeholders across different domains. The cyber domain is also an opportunity for significant regional economic and technological development. IMDA actively engages international counterparts through platforms such as Asia Pacific Computer Emergency Response Team (APCERT), Forum of Incident Response and Security Teams (FIRST) and ASEAN Cert Incident Drill (ACID). Critical Infocomm Infrastructure Protection (CIIP) is another key area of focus in international collaboration. IMDA is an active participant in the Meridian Process which provides a platform for Governments to discuss how to work together on CIIP at the policy level."
}
,{
"title": "What Can I Do for Smart Nation?",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html",
"text": "What Can I Do for Smart Nation? If you have read up to this section, and are wondering how you as a citizen or organisation in Singapore can contribute, here are a few things you can do:"
}
,{
"title": "Start reading and learning more about technology today",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html#start-reading-and-learning-more-about-technology-today",
"text": "Start reading and learning more about technology today There are many resources online for every level, and many of them are free. If you prefer learning in-person, attend a talk or course offered by the National Library, your nearest Community Centre, or from private organisations. SkillsFuture also offers many courses – use your SkillsFuture credit if you are 25 and above to kick start your learning journey today! To learn more about deep tech, SG Innovate organises frequent events around artificial intelligence, robotics, medtech, blockchain and other deep tech topics."
}
,{
"title": "Make use of Government tech platforms and open data to build meaningful applications/design programmes for the community",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html#make-use-of-government-tech-platforms-and-open-data-to-build-meaningful-applicationsdesign-programmes-for-the-community",
"text": "Make use of Government tech platforms and open data to build meaningful applications/design programmes for the community Data.gov.sg was first launched in 2011 as the government’s one-stop portal to its publicly-available datasets from 70 public agencies. To date, more than 100 apps have been created using the government’s open data. There are two types of APIs on data.gov.sg. One provides access to static tabular data such as time series or listings (i.e. CKAN APIs), while the other provides access to real-time datasets such as weather and traffic conditions. There are currently 14 real-time APIs on data.gov.sg that provide data ranging from taxi availability to weather forecasts."
}
,{
"title": "Adopt digital solutions in your organisations",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html#adopt-digital-solutions-in-your-organisations",
"text": "Adopt digital solutions in your organisations Think about the opportunities and possibilities that you can enjoy with digital technologies such as accessing new markets and improving your operational efficiencies! SMEs can refer to the sector-specific digital roadmaps under the SMEs Go Digital programme for advice on to determine the digital solutions that they can to use at each stage of their growth. They can consult principal consultant at the SME Digital Tech Hub for expert help to better appreciate digitalisation before they embark on it their digital journey. They can also select from the list of proven digital solutions pre-approved by IMDA, or embark participate on in industry-led pilot projects, and take advantage of the Digital Project Management Services to help with their implementation."
}
,{
"title": "Reach out to those who need help with digital access and literacy",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html#reach-out-to-those-who-need-help-with-digital-access-and-literacy",
"text": "Reach out to those who need help with digital access and literacy Join the SG:D Friends network! Building on the Friends of Silver Infocomm programme launched in August 2016, the SG:D Friends programme offers expanded opportunities for everyone, as well as public and private organisations to reach out to all segments of the community, including mature adult and seniors, students, low-income families and people with disabilities. Corporates may join as well, by providing corporate volunteers, conducting digital training or helping to disseminate communications related to digital readiness. Businesses are well placed to help their customers and employees acquire digital skills and adopt digital technology, and we encourage everyone to step up to support this digital movement! If you have a meaningful project, you can apply for funding support from MCCY’s Our Singapore Fund. If you are under 35, you can tap into the National Youth Council’s National Youth Fund or the Young ChangeMakers (YCM) grant."
}
,{
"title": "Tell us what ideas and solutions you have for Smart Nation!",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/09-what-can-i-do.html#tell-us-what-ideas-and-solutions-you-have-for-smart-nation",
"text": "Tell us what ideas and solutions you have for Smart Nation! Ideas! is the centralised platform for whole-of-government crowdsourcing activities. The Government has been organising activities in the form of challenges, such as contests for idea generation, application development, hackathons, to solve problems and issues that Singaporeans may be facing. Sign up using SingPass, and stand a chance to win prizes when you take part in challenges, and engage directly with government agencies to share your ideas. Tech Kakis, an initiative by GovTech, is a community for citizen engagement. Through Tech Kaki, fellow citizens are invited to share their ideas on GovTech’s current and upcoming citizen products and services. Anyone with an interest to improve government digital products and services (not just the tech-savvy! is welcome to join the community. GovTech has organised Tech Kaki meet-ups to gather feedback from citizens of all walks of life. These engagements help GovTech better understand user needs and further refine its digital offerings. For example, GovTech has held conversations on Parking.sg and the use of chatbots to perform government transactions. If you are a solution provider, you can take part in the InnoLeap programme. InnoLeap’s various platforms, such as thematic workshops, technology sharing days and clinics. These bring together public sector agencies and solution providers to facilitate potential matching of technology solutions to public sector problem statements. Of course, you are looking for meaningful professional opportunities to contribute directly to shaping Smart Nation, consider the Smart Nation Scholarship or Smart Nation Fellowship, or look out for relevant job openings through Careers@Gov. Last, but not least, you can also write to us to share your feedback on Smart Nation at smartnation@pmo.gov.sg"
}
,{
"title": "Conclusion",
"documentTitle": "Smart Nation: The Way Forward",
"url": "/opendoc-smartnation-strategy/10-conclusion.html",
"text": "Conclusion The digital revolution can either be exhilarating or terrifying, or both. It depends on whether we are ready. Either way, it will be necessary to keep Singapore an exceptional nation. That is why we have embarked on Smart Nation, and should continue to drive it with a great sense of urgency. The Government will continue to invest heavily in infrastructure, create open platforms, share open data, encourage our businesses to adopt the latest technologies and facilitate skills upgrading and digital readiness for citizens. Businesses will also need to rise to the occasion to make structural and financial investments in digital technologies, cultivating talents and shifting mind-sets that will be necessary for the future. Singaporeans must be flexible, eager to learn, and adventurous to venture beyond our shores. The digital era is rapidly evolving, but we have never been better prepared to shape the future as we are now. Together, as a nation for our nation."
}
]